/*
 * Copyright (c) 2018 Wormpex.com. All Rights Reserved
 */
package com.example.leetcode.interview;

/**
 * @author liuhongbin on 2019-09-16 10:41 
 */
public class Tantan {

//	        一面
//1. 算法：轮询任意个数组，合并成同一个数组
//	输入：[A,B,C], [1,2,3,4]
//	输出：[A,1,B,2,C,3,4]
//2. 设计题：设计一个主播实时排行榜，主播可以收到礼物，要求能实时展示主播排名及相邻的主播，可以查询任意排名内的主播
//3. redis都有哪些使用场景
//4. 分布式锁还有其他实现方式吗（除redis）
//5. redis的数据结构
//6. 针对2的设计题，如果排行榜数量很大，需要分页怎么办
//7. 有10亿个数，求topk
//8. 有10亿个数，求第k大的数
//9. 算法：快速排序实现
//
//			二面
//
//1. 说下项目中数据库的核心表结构
//2. 设计题：评论楼中楼的方式底层数据库表如何实现
//3. InooDB索引数据结构，实现原理
//4. 说下哈希的数据结构，数据量过大怎么办
//5. 哈希扩容时，有插入操作会很慢，如何解决（单线程）
//6. redis的数据结构，zset的实现原理
//7. 一个请求到服务端，服务端响应的整个过程
//8. UDP能可靠传输吗
//9. TCP建立连接的传输过程，如何保证报文的可靠性，每次生成的序列号都是随机的吗
//10. 解释下网段和子网掩码
//11. 算法：蛇形有序的数组如何查询某个数据
//	输入：[5,6,0,1,2,3,4], 3
//	输出：5
//12. 前后端联调都有哪些需要注意的地方
//13. 今年都看过哪些技术方面的书籍


}
